yuanchui/CDC_code/PCAP04电路STM32程序/PCAP04电路STM32程序_标准库能正常运行PB/W25Q16/w25q16.h
#ifndef	__W25Q16_H_
#define __W25Q16_H_
#include "stm32f10x_conf.h"
/* 这里只宏定义了端口 引脚 模块，相关时钟请进入
void SPI_Configuration(void)使能*/
#define PCAP_PORT				GPIOA
#define PCAP_SSN_PIN			GPIO_Pin_4
#define PCAP_SCK_PIN			GPIO_Pin_5
#define PCAP_MISO_PIN			GPIO_Pin_6
#define PCAP_MOSI_PIN			GPIO_Pin_7
#define PCAP_SPI	            SPI1

/* W25Q16片选 */
#define PCAP_CS_LOW()       GPIO_ResetBits(GPIOA, GPIO_Pin_4)
#define PCAP_CS_HIGH()      GPIO_SetBits(GPIOA, GPIO_Pin_4)

/* W25X16系列ID是0XEF14 */
#define W25Q16_ID  0XEF14

/* W25Q16指令表	*/
#define W25X_WriteEnable		0x06 
#define W25X_WriteDisable		0x04 
#define W25X_ReadStatusReg		0x05 
#define W25X_WriteStatusReg		0x01 
#define W25X_ReadData			0x03 
#define W25X_FastReadData		0x0B 
#define W25X_FastReadDual		0x3B 
#define W25X_PageProgram		0x02 
#define W25X_BlockErase			0xD8 
#define W25X_SectorErase		0x20 
#define W25X_ChipErase			0xC7 
#define W25X_PowerDown			0xB9 
#define W25X_ReleasePowerDown	0xAB 
#define W25X_DeviceID			0xAB 
#define W25X_ManufactDeviceID	0x90 
#define W25X_JedecDeviceID		0x9F 


u8 SPIx_WritereadWORD(u16 TxData);
u8 SPIx_WritereadDWORD(u32 TxData);

void SPI_Configuration(void);




/* 读状态寄存器 */
uint8_t SPI_Flash_ReadSR(void);
uint8_t SPI_Flash_WriteSR(uint16_t);
   
void SPI_Flash_Read(u8* pBuffer,u32 ReadAddr,u16 NumByteToRead);
void SPI_Flash_Write_Page(u8* pBuffer,u32 WriteAddr,u16 NumByteToWrite);   
void SPI_Flash_Erase_Chip(void);   
void SPI1_WriteByte(u8 TxData);
void SPI1_SetSpeed(u8 SPI_BaudRatePrescaler);

#endif

